artillery/artillery-ca-list.yml
config:
  target: "{{ $processEnvironment.ARTILLERY_TARGET }}"
  includeFiles:
    - CA-DL.jpg
    - Medical-Card.png
  phases:
    - duration: 900
      arrivalRate: 1
      maxVusers: 10
  engines:
    playwright:
      trace: true
      launchOptions:
        headless: true
      contextOptions:
        userAgent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36'
        viewport:
          width: 1280
          height: 720
  processor: './artillery-ca-list-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'CA'