artillery/artillery-thelist-image-upload-rate-limit.yml
config:
  target: "{{ $processEnvironment.ARTILLERY_TARGET }}"
  includeFiles:
    - CA-DL.jpg
    - CA-DL.png
    - CA-DL.heic
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 1
  engines:
    playwright:
      trace: false
      launchOptions:
        headless: true
      contextOptions:
        userAgent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36'
        viewport:
          width: 1280
          height: 720
  processor: './artillery-thelist-image-uploads-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'TheListImageUploadRateLimit'